travel-book-api/app/controllers/bucket_lists_controller.rb

SELECT "bucket_lists".* FROM "bucket_lists"
---
  def index
    logs = BucketList.all