travel-book-api/app/controllers/countries_controller.rb

SELECT "countries".* FROM "countries"
---
  def index
    countries = Country.all