travel-book-api/app/controllers/travel_logs_controller.rb

  def index
    logs = TravelLog.all
---
SELECT "travel_logs".* FROM "travel_logs"