travel-book-api/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "Aliya"], ["LIMIT", 1]]
SELECT  1 AS one FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", ""], ["LIMIT", 1]]
SELECT "users".* FROM "users"
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ""], ["created_at", "2019-07-31 03:24:22.507673"], ["updated_at", "2019-07-31 03:24:22.507673"]]
---
  def create
    @user = User.find_by(name: params[:name])
    if !(User.all.include?(@user))
      @newUser = User.create(name: params[:name])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def show
    @user = User.find(params[:id].to_i)